#include <stdio.h>
int main(void) {
    int n;
    if (scanf("%d", &n) == 1) {
        int sum = 0;
        if (n < 0) {
            n = -n;
        }
        /*
         Для накопления суммы используется оператор +=, так как 
         он прибавляет очередное слагаемое к накопленному результату (начальное значение 0).
         Для произведения использовался бы оператор *=, так как очередной 
         множитель должен домножаться на накопленный результат (начальное значение 1).
         */
        while (n > 0) {
            int digit = n % 10;
            sum += digit;
            n /= 10;
        }
        printf("SUM: %d\n", sum);
    }
    return 0;
}