#include <stdio.h>
int main(void) {
    int n;
    if (scanf("%d", &n) == 1 && n > 0) {
        int val = 0;
        int i = 0;
        int count = 0;
        /*
         Префиксный инкремент (++i) сначала увеличивает переменную на 1, а затем 
         возвращает ее новое значение.
         Постфиксный инкремент (i++) сначала возвращает старое значение, 
         а увеличивает переменную только после выполнения операции.
         В этом задании важен порядок: для формулы a[i] = a[i-1] + i мы используем 
         префиксный инкремент (++i), чтобы переменная i сначала увеличилась на 1,
         и к сумме прибавилось уже актуальное новое слагаемое.
         */
        while (count < n) {
            printf("%d ", val);
            ++i;
            val = val + i;
            count++;
        }
        printf("\n");
    }
    return 0;
}